IDENTIFICATION DIVISION.
PROGRAM-ID. S_04.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM PIC 9(3).
88 PASS VALUES ARE 000 THRU 100.
88 FAIL VALUES ARE 101 THRU 999.
01 testValue PIC 9(3).

PROCEDURE DIVISION.

DISPLAY "Enter value to test 0-999".
ACCEPT testValue FROM CONSOLE.

MOVE testValue TO WS-NUM.

IF PASS
DISPLAY 'Passed with ' WS-NUM ' marks'
end-if.

IF FAIL
DISPLAY 'FAILED with ' WS-NUM ' marks'
end-if.

STOP RUN.
